# LABORATORIO 2

In [ ]:
!pip install pandasql
import numpy as np
import pandas as pd
heroes = pd.read_csv("heroes_information.csv")

In [ ]:
###instalar desde anaconda navigator######
from pandasql import *

In [ ]:
pysqldf = lambda q: sqldf(q,globals())

In [ ]:
query2 = " SELECT * FROM heroes limit 10"

In [ ]:
pysqldf(query2)

# Nombre del primer superhéroe de la tabla heroes

In [ ]:
pregunta_1 = " SELECT name FROM heroes limit 1 "

In [113]:
pysqldf(pregunta_1)

     name
0  A-Bomb

# Cantidad de casas publicadoras

In [102]:
pregunta_2="SELECT COUNT(DISTINCT Publisher) FROM heroes"

In [103]:
pysqldf(pregunta_2)

   COUNT(DISTINCT Publisher)
0                         24

# ¿Cuántos superhéroes miden más de 2 metros (200 cms)?

In [85]:
pregunta_3 = " SELECT COUNT(*) FROM heroes WHERE height > 200"

In [86]:
pysqldf(pregunta_3)

   COUNT(*)
0        59

# ¿Cuántos superhéroes son humanos y miden más de 2 metros (200 cms)?

In [87]:
pregunta_4= pregunta_4 ="SELECT count(*) FROM heroes WHERE height > 200 AND race = 'Human'"

In [88]:
pysqldf(pregunta_4)

   count(*)
0        12

# ¿Cuántos superhéroes pesan más de 100 lbs y menos de 200 lbs?

In [89]:
pregunta_5= "SELECT COUNT(*)FROM heroes WHERE weight > 100 AND weight < 200"

In [90]:
pysqldf(pregunta_5)

   COUNT(*)
0        98

# ¿Cuántos superhéroes tienen los ojos de color azul o rojo?

In [71]:
pregunta_6="SELECT COUNT(*) FROM heroes WHERE `Eye color` = 'blue' OR `Eye color`='red'"

In [72]:
pysqldf(pregunta_6)

   COUNT(*)
0       271

# ¿Cuántos superhéroes son Human, Mutant y tienen el pelo color Verde o son Vampiros con pelo Negro?

In [73]:
pregunta_7="SELECT COUNT(*) FROM heroes WHERE (Race in ('Human', 'Mutant') AND `Hair color` = 'Green') OR (Race = 'Vampire' AND `Hair color` = 'Black')"

In [ ]:
pysqldf(pregunta_7)

# ¿Cuál es el nombre del primer superhéroe si ordeno la tabla por raza en orden descendente?

In [106]:
pregunta_8 ="SELECT name FROM heroes ORDER BY race DESC LIMIT 1"

In [107]:
pysqldf(pregunta_8)

             name
0  Solomon Grundy

# ¿Cuántos superhéroes son de género masculino y cuántas de género femenino?

In [ ]:
pregunta_9="SELECT Gender, COUNT(*) FROM heroes GROUP BY Gender"

In [108]:
pysqldf(pregunta_9)

   Gender  COUNT(*)
0    None        29
1  Female       200
2    Male       505

# ¿Cuántas casas publicadoras tienen más de 15 superhéroes?

In [109]:
pregunta_10="SELECT Publisher, count(name) FROM heroes GROUP BY Publisher HAVING COUNT(Publisher) > 15"

In [110]:
pysqldf(pregunta_10)

           Publisher  count(name)
0          DC Comics          215
1  Dark Horse Comics           18
2      Marvel Comics          388
3       NBC - Heroes           19